app/controllers/comments_controller.rb

INSERT INTO `comments` (`text`, `tweet_id`, `user_id`, `created_at`, `updated_at`) VALUES ('あいうえお', 11, 2, '2017-02-22 13:20:35', '2017-02-22 13:20:35')
---
	def create
		@comment = Comment.create(text: comment_params[:text], tweet_id: comment_params[:tweet_id], user_id: current_user.id)