app/controllers/tweets_controller.rb

	def index					#ツイート一覧
		@tweets = Tweet.includes(:user).all.order("created_at DESC").page(params[:page]).per(5)
---
SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)

	def create					#レコード保存
		Tweet.create(image:tweet_params[:image],text:tweet_params[:text],user_id:current_user.id)
---
INSERT INTO `tweets` (`name`, `image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('bayasi', 'https://tech-master.s3.amazonaws.com/uploads/curriculums//0025d4f574f24613b9ad30546c799e93.png', 'データベース', 2, '2017-02-21 10:31:22', '2017-02-21 10:31:22')

	def destroy					#ツイート削除
      tweet = Tweet.find(params[:id])
      if tweet.user_id == current_user.id
        tweet.destroy
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 13 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 13

    def edit					#編集
    	@tweet = Tweet.find(params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1

    def update					#編集
     tweet = Tweet.find(params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1

    def show					#詳細
    	@tweet = Tweet.find(params[:id])
    	@comments = @tweet.comments.includes(:user)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 12