app/controllers/users_controller.rb

	def show
		user = User.find(params[:id])
		@nickname = user.nickname
		#@tweets = Tweet.where(user_id:current_user.id).all.order("created_at DESC").page(params[:page]).per(5)
		@tweets = user.tweets.page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 2  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets` WHERE `tweets`.`user_id` = 1